using AOMMembers.Data.Models;

namespace AOMMembers.Data.Seeding
{
    public class WorldviewsSeeder : ISeeder
    {
        public async Task SeedAsync(ApplicationDbContext dbContext, IServiceProvider serviceProvider)
        {
            if (dbContext.Worldviews.Any())
            {
                return;
            }

            List<(string Id, string Description, string Ideology, string CitizenId)> worldviews = new List<(string Id, string Description, string Ideology, string CitizenId)>
            {
                ("WorldviewIdIvanIvanov", "Смятам, че държавата трябва да намали контрола над гражданите си и да свие до минимум административния апарат.", "Привърженик съм на класическия либерализъм, в смисъл на минимална намеса на държавните структури в живота на хората, но не одобрявам съвременните неолиберални течения, които за съжаление понякога се наричат либерални.", "CitizenIdIvanIvanov"),
                ("WorldviewIdStoyanDuvarov", "Смятам, че държавата трябва да намали контрола над гражданите си и да свие до минимум административния апарат.", "Привърженик съм на класическия либерализъм, в смисъл на минимална намеса на държавните структури в живота на хората, но не одобрявам съвременните неолиберални течения, които за съжаление понякога се наричат либерални.", "CitizenIdStoyanDuvarov"),
                ("WorldviewIdBoykoArmeyski", "Смятам, че държавата трябва да намали контрола над гражданите си и да свие до минимум административния апарат.", "Привърженик съм на класическия либерализъм, в смисъл на минимална намеса на държавните структури в живота на хората, но не одобрявам съвременните неолиберални течения, които за съжаление понякога се наричат либерални.", "CitizenIdYustinianZakonov"),
                ("WorldviewIdSokratPlatonov", "Смятам, че държавата трябва да намали контрола над гражданите си и да свие до минимум административния апарат.", "Привърженик съм на класическия либерализъм, в смисъл на минимална намеса на държавните структури в живота на хората, но не одобрявам съвременните неолиберални течения, които за съжаление понякога се наричат либерални.", "CitizenIdSokratPlatonov"),
                ("WorldviewIdArpaEfirova", "Смятам, че държавата трябва да намали контрола над гражданите си и да свие до минимум административния апарат.", "Привърженик съм на класическия либерализъм, в смисъл на минимална намеса на държавните структури в живота на хората, но не одобрявам съвременните неолиберални течения, които за съжаление понякога се наричат либерални.", "CitizenIdArpaEfirova"),
                ("WorldviewIdNikolaDaskalov", "Смятам, че държавата трябва да намали контрола над гражданите си и да свие до минимум административния апарат.", "Привърженик съм на класическия либерализъм, в смисъл на минимална намеса на държавните структури в живота на хората, но не одобрявам съвременните неолиберални течения, които за съжаление понякога се наричат либерални.", "CitizenIdNikolaDaskalov"),
                ("WorldviewIdMariaGospojina", "Смятам, че държавата трябва да намали контрола над гражданите си и да свие до минимум административния апарат.", "Привърженик съм на класическия либерализъм, в смисъл на минимална намеса на държавните структури в живота на хората, но не одобрявам съвременните неолиберални течения, които за съжаление понякога се наричат либерални.", "CitizenIdMariaGospojina"),
                ("WorldviewIdGabrielaFrankfurtska", "Смятам, че държавата трябва да намали контрола над гражданите си и да свие до минимум административния апарат.", "Привърженик съм на класическия либерализъм, в смисъл на минимална намеса на държавните структури в живота на хората, но не одобрявам съвременните неолиберални течения, които за съжаление понякога се наричат либерални.", "CitizenIdGabrielaFrankfurtska"),
                ("WorldviewIdSnaksMacNinsky", "Смятам, че държавата трябва да намали контрола над гражданите си и да свие до минимум административния апарат.", "Привърженик съм на класическия либерализъм, в смисъл на минимална намеса на държавните структури в живота на хората, но не одобрявам съвременните неолиберални течения, които за съжаление понякога се наричат либерални.", "CitizenIdSnaksMacNinsky"),
                ("WorldviewIdElenaRudolf", "Смятам, че държавата трябва да намали контрола над гражданите си и да свие до минимум административния апарат.", "Привърженик съм на класическия либерализъм, в смисъл на минимална намеса на държавните структури в живота на хората, но не одобрявам съвременните неолиберални течения, които за съжаление понякога се наричат либерални.", "CitizenIdElenaRudolf"),
                ("WorldviewIdIbrahimKoch", "Смятам, че държавата трябва да намали контрола над гражданите си и да свие до минимум административния апарат.", "Привърженик съм на класическия либерализъм, в смисъл на минимална намеса на държавните структури в живота на хората, но не одобрявам съвременните неолиберални течения, които за съжаление понякога се наричат либерални.", "CitizenIdIbrahimKoch"),
                ("WorldviewIdGoritsaDubova", "Смятам, че държавата трябва да намали контрола над гражданите си и да свие до минимум административния апарат.", "Привърженик съм на класическия либерализъм, в смисъл на минимална намеса на държавните структури в живота на хората, но не одобрявам съвременните неолиберални течения, които за съжаление понякога се наричат либерални.", "CitizenIdGoritsaDubova")
            };

            foreach ((string Id, string Description, string Ideology, string CitizenId) worldview in worldviews)
            {
                Worldview dbWorldview = new Worldview
                {
                    Description = worldview.Description,
                    Ideology = worldview.Ideology,
                    CitizenId = worldview.CitizenId
                };
                dbWorldview.Id = worldview.Id;
                await dbContext.Worldviews.AddAsync(dbWorldview);
            }

            await dbContext.SaveChangesAsync();
        }
    }
}